arendst/Tasmota/arduino/version 2.4.1/boards.txt
##############################################################
d1_mini_pro.name=WeMos D1 mini Pro
d1_mini_pro.build.board=ESP8266_WEMOS_D1MINIPRO
d1_mini_pro.build.variant=d1_mini
d1_mini_pro.upload.tool=esptool
d1_mini_pro.upload.maximum_data_size=81920
d1_mini_pro.upload.wait_for_upload_port=true
d1_mini_pro.upload.erase_cmd=
d1_mini_pro.serial.disableDTR=true
d1_mini_pro.serial.disableRTS=true
d1_mini_pro.build.mcu=esp8266
d1_mini_pro.build.core=esp8266
d1_mini_pro.build.spiffs_pagesize=256
d1_mini_pro.build.debug_port=
d1_mini_pro.build.debug_level=
d1_mini_pro.menu.CpuFrequency.80=80 MHz
d1_mini_pro.menu.CpuFrequency.80.build.f_cpu=80000000L
d1_mini_pro.menu.CpuFrequency.160=160 MHz
d1_mini_pro.menu.CpuFrequency.160.build.f_cpu=160000000L
d1_mini_pro.upload.resetmethod=nodemcu
d1_mini_pro.build.flash_mode=dio
d1_mini_pro.build.flash_freq=40
d1_mini_pro.menu.FlashSize.16M15M=16M (15M SPIFFS)
d1_mini_pro.menu.FlashSize.16M15M.build.flash_size=16M
d1_mini_pro.menu.FlashSize.16M15M.build.flash_size_bytes=0x1000000
d1_mini_pro.menu.FlashSize.16M15M.build.flash_ld=eagle.flash.16m.ld
d1_mini_pro.menu.FlashSize.16M15M.build.spiffs_pagesize=256
d1_mini_pro.menu.FlashSize.16M15M.upload.maximum_size=1044464
d1_mini_pro.menu.FlashSize.16M15M.build.rfcal_addr=0xFFC000
d1_mini_pro.menu.FlashSize.16M15M.build.spiffs_start=0x100000
d1_mini_pro.menu.FlashSize.16M15M.build.spiffs_end=0xFFB000
d1_mini_pro.menu.FlashSize.16M15M.build.spiffs_blocksize=8192
d1_mini_pro.menu.LwIPVariant.v2mss536=v2 Lower Memory
d1_mini_pro.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
d1_mini_pro.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
d1_mini_pro.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
d1_mini_pro.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
d1_mini_pro.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
d1_mini_pro.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
d1_mini_pro.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
d1_mini_pro.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
d1_mini_pro.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
d1_mini_pro.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_pro.menu.LwIPVariant.OpenSource=v1.4 Compile from source
d1_mini_pro.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
d1_mini_pro.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_pro.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
d1_mini_pro.menu.Debug.Disabled=Disabled
d1_mini_pro.menu.Debug.Disabled.build.debug_port=
d1_mini_pro.menu.Debug.Serial=Serial
d1_mini_pro.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini_pro.menu.Debug.Serial1=Serial1
d1_mini_pro.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
d1_mini_pro.menu.DebugLevel.None____=None
d1_mini_pro.menu.DebugLevel.None____.build.debug_level=
d1_mini_pro.menu.DebugLevel.SSL=SSL
d1_mini_pro.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
d1_mini_pro.menu.DebugLevel.TLS_MEM=TLS_MEM
d1_mini_pro.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
d1_mini_pro.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
d1_mini_pro.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
d1_mini_pro.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
d1_mini_pro.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_pro.menu.DebugLevel.CORE=CORE
d1_mini_pro.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
d1_mini_pro.menu.DebugLevel.WIFI=WIFI
d1_mini_pro.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
d1_mini_pro.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
d1_mini_pro.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
d1_mini_pro.menu.DebugLevel.UPDATER=UPDATER
d1_mini_pro.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
d1_mini_pro.menu.DebugLevel.OTA=OTA
d1_mini_pro.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
d1_mini_pro.menu.DebugLevel.OOM=OOM
d1_mini_pro.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_pro.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_pro.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_pro.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_pro.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini_pro.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini_pro.menu.FlashErase.none=Only Sketch
d1_mini_pro.menu.FlashErase.none.upload.erase_cmd=
d1_mini_pro.menu.FlashErase.sdk=Sketch + WiFi Settings
d1_mini_pro.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
d1_mini_pro.menu.FlashErase.all=All Flash Contents
d1_mini_pro.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
d1_mini_pro.menu.UploadSpeed.921600=921600
d1_mini_pro.menu.UploadSpeed.921600.upload.speed=921600
d1_mini_pro.menu.UploadSpeed.9600=9600
d1_mini_pro.menu.UploadSpeed.9600.upload.speed=9600
d1_mini_pro.menu.UploadSpeed.57600=57600
d1_mini_pro.menu.UploadSpeed.57600.upload.speed=57600
d1_mini_pro.menu.UploadSpeed.115200=115200
d1_mini_pro.menu.UploadSpeed.115200.upload.speed=115200
d1_mini_pro.menu.UploadSpeed.230400.linux=230400
d1_mini_pro.menu.UploadSpeed.230400.macosx=230400
d1_mini_pro.menu.UploadSpeed.230400.upload.speed=230400
d1_mini_pro.menu.UploadSpeed.256000.windows=256000
d1_mini_pro.menu.UploadSpeed.256000.upload.speed=256000
d1_mini_pro.menu.UploadSpeed.460800.linux=460800
d1_mini_pro.menu.UploadSpeed.460800.macosx=460800
d1_mini_pro.menu.UploadSpeed.460800.upload.speed=460800
d1_mini_pro.menu.UploadSpeed.512000.windows=512000
d1_mini_pro.menu.UploadSpeed.512000.upload.speed=512000

