arendst/Tasmota/arduino/version 2.4.1/boards.txt
##############################################################
oak.name=Digistump Oak
oak.build.board=ESP8266_OAK
oak.build.variant=oak
oak.upload.maximum_size=1040368
oak.upload.tool=esptool
oak.upload.maximum_data_size=81920
oak.upload.wait_for_upload_port=true
oak.upload.erase_cmd=
oak.serial.disableDTR=true
oak.serial.disableRTS=true
oak.build.mcu=esp8266
oak.build.core=esp8266
oak.build.spiffs_pagesize=256
oak.build.debug_port=
oak.build.debug_level=
oak.menu.CpuFrequency.80=80 MHz
oak.menu.CpuFrequency.80.build.f_cpu=80000000L
oak.menu.CpuFrequency.160=160 MHz
oak.menu.CpuFrequency.160.build.f_cpu=160000000L
oak.upload.resetmethod=none
oak.build.flash_mode=dio
oak.build.flash_freq=40
oak.menu.FlashSize.4M1M=4M (1M SPIFFS)
oak.menu.FlashSize.4M1M.build.flash_size=4M
oak.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
oak.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
oak.menu.FlashSize.4M1M.build.spiffs_pagesize=256
oak.menu.FlashSize.4M1M.upload.maximum_size=1044464
oak.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
oak.menu.FlashSize.4M1M.build.spiffs_start=0x300000
oak.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
oak.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
oak.menu.FlashSize.4M3M=4M (3M SPIFFS)
oak.menu.FlashSize.4M3M.build.flash_size=4M
oak.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
oak.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
oak.menu.FlashSize.4M3M.build.spiffs_pagesize=256
oak.menu.FlashSize.4M3M.upload.maximum_size=1044464
oak.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
oak.menu.FlashSize.4M3M.build.spiffs_start=0x100000
oak.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
oak.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
oak.menu.LwIPVariant.v2mss536=v2 Lower Memory
oak.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
oak.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
oak.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
oak.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
oak.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
oak.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
oak.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
oak.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
oak.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
oak.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
oak.menu.LwIPVariant.OpenSource=v1.4 Compile from source
oak.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
oak.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
oak.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
oak.menu.Debug.Disabled=Disabled
oak.menu.Debug.Disabled.build.debug_port=
oak.menu.Debug.Serial=Serial
oak.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
oak.menu.Debug.Serial1=Serial1
oak.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
oak.menu.DebugLevel.None____=None
oak.menu.DebugLevel.None____.build.debug_level=
oak.menu.DebugLevel.SSL=SSL
oak.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
oak.menu.DebugLevel.TLS_MEM=TLS_MEM
oak.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
oak.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
oak.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
oak.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
oak.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
oak.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
oak.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
oak.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
oak.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
oak.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
oak.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
oak.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
oak.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
oak.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
oak.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.DebugLevel.CORE=CORE
oak.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
oak.menu.DebugLevel.WIFI=WIFI
oak.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
oak.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
oak.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
oak.menu.DebugLevel.UPDATER=UPDATER
oak.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
oak.menu.DebugLevel.OTA=OTA
oak.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
oak.menu.DebugLevel.OOM=OOM
oak.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
oak.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
oak.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
oak.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
oak.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
oak.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
oak.menu.FlashErase.none=Only Sketch
oak.menu.FlashErase.none.upload.erase_cmd=
oak.menu.FlashErase.sdk=Sketch + WiFi Settings
oak.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
oak.menu.FlashErase.all=All Flash Contents
oak.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
oak.menu.UploadSpeed.921600=921600
oak.menu.UploadSpeed.921600.upload.speed=921600
oak.menu.UploadSpeed.9600=9600
oak.menu.UploadSpeed.9600.upload.speed=9600
oak.menu.UploadSpeed.57600=57600
oak.menu.UploadSpeed.57600.upload.speed=57600
oak.menu.UploadSpeed.115200=115200
oak.menu.UploadSpeed.115200.upload.speed=115200
oak.menu.UploadSpeed.230400.linux=230400
oak.menu.UploadSpeed.230400.macosx=230400
oak.menu.UploadSpeed.230400.upload.speed=230400
oak.menu.UploadSpeed.256000.windows=256000
oak.menu.UploadSpeed.256000.upload.speed=256000
oak.menu.UploadSpeed.460800.linux=460800
oak.menu.UploadSpeed.460800.macosx=460800
oak.menu.UploadSpeed.460800.upload.speed=460800
oak.menu.UploadSpeed.512000.windows=512000
oak.menu.UploadSpeed.512000.upload.speed=512000

